In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("C:/Users/Damodhara/Desktop/DSMP Dataset/titanic.csv")

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
pop=df['Age'].dropna()

In [7]:
sample_age=pop.sample(25).values

In [8]:
sample_age

array([21. , 25. , 27. , 36. , 80. , 19. , 34. , 71. , 11. , 51. , 20. ,
       29. , 22. , 14. , 34. , 64. , 45.5, 29. , 22. , 25. , 24. , 26. ,
       26. , 30. , 30. ])

In [9]:
#H0-> The mean age is 35
#H1-> The mean is less than 35

In [10]:
#check for normality using shapiro wilk test 
from scipy.stats import shapiro
shapiro_age=shapiro(sample_age)

In [11]:
print(shapiro_age)

ShapiroResult(statistic=0.8240994215011597, pvalue=0.0005900374380871654)

In [12]:
pop_mean=35

In [13]:
import scipy.stats as stats
t_statistic, p_value=stats.ttest_1samp(sample_age, pop_mean)

In [14]:
print("t-statistic:", t_statistic)
print("p-value:",p_value/2)

t-statistic: -0.6923247604636227
p-value: 0.24768899596516186

In [15]:
alpha=0.05
if p_value< alpha:
    print('Reject the null hypothesis')
else:
    print('Fail to reject the null hyopthesis')

Fail to reject the null hyopthesis

the null hypothesis reject so the the, assumption of the mean age is greater than 35 years is True